# 应用一：打印星号（正方形）
"""
1. 打印1个星星
2. 一行5个：循环 —— 5个星星在一行显示
3. 打印5行星星：循环 —— 一行5个
"""

a = 0
while a < 5:
    # 一行星星开始打印
    i = 0
    while i < 5:
        print('*', end='')  # 取消换行打印
        i += 1
    # 一行星星结束打印，并换行打印下一行
    print()
    a += 1

# 应用二 + 应用三：打印星号（三角形） + 打印九九乘法表
# 多行多个乘法表达式： x * x = x * x

"""
1. 打印一个乘法表达式： x * x = x * x 
2. 一行打印多个表达式 —— 一行表达式的个数行号数相等 —— 循环：一个表达式 —— 不换行
3. 打印多行表达式 —— 循环： 一行表达式 —— 换行

**** 一行表达式的个数和行号数相等
"""
h = 1
while h <= 9:
    c = 1
    while c <= h:
        print(f'{c} * {h} = {c * h}', end='\t')
        c += 1
    # 一行的表达式结束
    print()
    h += 1
