# while 应用（1）：计算1~100的累加求和
# 需求：1~100的数字累加求和，也就是：1 + 2 + 3 + 4 + ... + 100
"""
1. 准备做加法运算的数据‘1~100’，其中增加的量为 1
2. 准备变量保存将来运算的结果
3. 循环做加法运算
4. 打印结果
5. 验证结果的正确性
"""

# 准备数据
i = 1

# 结果变量
result = 0

# 开始循环
while i <= 100:
    # 加法运算，前两个数的结果 + 第三个数 ———— 每一次计算加法法则更新一次 result 变量值
    # result = result + i
    result += i
    i += 1


# 打印最终结果
print(result)

# while 应用（2）：计算1~100偶数累加求和
# 方法一：条件判断和2取余数为0则累加运算
# 需求：1~100偶数累加求和，也就是： 2 + 4 + 6 + ... +100
"""
1. 准备累加的数字，开始1，结束100，增加的量为1
2. 准备保存结果的变量 result
3. 循环加法运算 —— 如果是偶数才给加法运算 —— 和2取余为0
4. 输出结果
5. 验证结果
"""
a = 1
result = 0
while a <= 100:
    # 条件语句 —— if
    if a % 2 == 0:
        # 加法运算
        result = result + a
    a += 1
# 输出结果
print(result)

# 方法二：计数器控制
c = 2
result = 0
while c <= 100:
    result += c
    c += 2
print(result)

# 方法三：for

n = 0
r = 0
# 从 0 开始，但不计入0
# 同理，以 101 结束，但不计入 101
# 所以，计算时只记录到 1 ~ 100 的数字序列
for n in range(0, 101, 2):
    r += n
# 2550
print(r)

r = 0
for n in range(0, 100, 2):
    r += n
# 2450
print(r)