//#include<iostream>
//using namespace std;
//
//int main() {
//	//do ... while 循环语句 实现
//	/*
//		水仙花数
//			水仙花数是指一个3位数，它的每个位上的书的3次幂之和等于它本身
//			例如：1 ^ 3 + 5 ^ 3 + 3 ^ 3 = 153
//	*/
//
//	//1.先打印所有百万位数
//	int num = 100;
//
//	do
//	{
//		//2.从所有三位数字中找到水仙花数
//		int a = 0;	//个位
//		int b = 0;	//十位
//		int c = 0;	//百位
//		int d = 0;	//千位
//
//		a = num % 10;	//获取个位
//		b = num / 10 % 10;	//获取十位
//		c = num / 100;	//获取百位
//
//		if (a*a*a  + b*b*b + c*c*c == num)	//如果是水仙花数，才打印
//		{
//			cout << num << endl;
//		}
//		num++;
//	} while (num<1000000);
//
//
//
//}