"""
    查找
·所谓字符串查找方法就是查找子串在字符串中的位置或出现的次数
    ·find():检测某个字串是否包含在字符串中，
    如果在返回这个字串开始的位置下标，否则则返回-1
        - 语法：
            字符串序列.find(子串,开始位置下标,结束为止下标)
        - 注意：
            开始和结束位置下标可以省略，表示在整个字符串序列中查找
        - 扩展：
                # right find
            rfind():和find()功能相同，但查找方向为右侧开始
    ·index():检测某个字串是否包含在这个字符串中，
    如果在返回这个子串开始的位置下标，否则则报异常
        - 语法：
            字符串序列.index(子串,开始位置下标,结束位置下标)
        - 注意：
            开始和结束位置下标可以省略，表示在整个字符串序列中查找
        - 扩展：
            rindex():和index()功能相同，但查找方向为右侧开始
    ·count():返回某个子串在字符串中出现的次数
        - 语法：
            字符串序列.count(子串,开始位置下标,结束位置下标
        - 注意：
            开始和结束位置下标可以省略，表示在整个字符串序列中查找
"""

hello = "I'm Chinese,I like China"
print(hello.index("I"))    # 0
print(hello.rindex("I"))    # 12

print(hello.count("I"))    # 2

print(hello.find("I"))    # 0
print(hello.rfind("I"))    # 12

