//#include <stdio.h>
//
//// 保护数组值
//int sum(const int arr[], int length);
//
//
//int main() {
//    
//    /*
//        只针对 C99
//
//        位置:
//            const 在*左边不能改内容，在*右边不能改方向
//
//    | 用处           | 类型                      | 示例     |
//    | ------        | -----------------------   | ------ |
//    | 防止误改内容    | `const int *p`            | 函数只读参数 |
//    | 防止乱改指针    | `int *const p`            | 固定指针指向 |
//    | 保护接口输出    | `const int *get()`        | 只读返回值  |
//    | 帮助优化       | `const int LIMIT = 100`   | 常量传播   |
//    | 编码规范       | 类函数后加 `const`          | 不改状态   |
//    | 保证安全       | `const char *str`         | 字符串安全  |
//
//    */
//
//    int a = 10;
//    int b = 20;
//
//    const int* p1 = &a;   // “指向常量的指针”
//    int* const p2 = &a;   // “常指针”
//    const int* const p3 = &a;  // “指向常量的常指针”
//
//    // p1：不能改内容，可以改指向
//    // *p1 = 30; [X] 错误
//    p1 = &b; // [OK] OK
//
//    // p2：能改内容，不能改指向
//    *p2 = 30; // [OK] OK
//    // p2 = &b; [X] 错误
//
//    // p3：什么都不能改
//    // *p3 = 40; [X]
//    // p3 = &b; [X]
//
//    printf("a = %d, b = %d\n", a, b);
//}
//
//// 防止意外修改 —— 保护数据
//void printValue(const int* p) {
//    printf("%d\n", *p);
//    // *p = 100; [X] 编译错误，保护了原数据
//}
//
//// 防止指针被乱改 —— 锁定指向
//void setValue(int* const p) {
//    *p = 42;   // [OK] 可改内容
//    // p = NULL; [X] 不能换指向
//}
//
//
//
//
//
