//#include<iostream>
//using namespace std;
//
///*
//	C/C++ 支持最基本的三种程序运行结构：
//		顺序结构、选择结构、循环结构
//
//	· 顺序结构：
//		程序按顺序运行，不发生跳转
//
//	· 选择结构：
//		依据条件是否满足，有选择性执行相应功能
//
//	· 循环结构：
//		依据条件是否满足，循环多次执行某段代码
//*/
//
//int main() {
//
//	//	选择结构	单行 if 语句
//	//	用户输入分数，如果分数大于600，视为考上一本大学，在屏幕上输出
//
//	//	用户输入分数
//	int score = 0;
//	cout << "请输入你的分数：" << endl;
//	cin >> score;
//
//
//	//	打印用户输入的分数
//	cout << "您输入的分数为：" << score << endl;
//
//	//	判断分数是否大于600，如果大于，则输出
//	//	注意事项：if条件后面不要加分号
//	if (score > 600)
//	{
//		cout << "恭喜您，考上了一本大学！" << endl;
//	}
//
//	system("pause");
//}