//#include<iostream>
//using namespace std;
//
//int main() {
//		//选择结构多条件fi语句
//
//	//输入一个考试分数，如果大于600分，是为考上一本大学，在屏幕输出
//	//大于500，视为考上二本大学，屏幕输出
//	//大于400，视为考上三本大学，屏幕输出
//	//小于等于400，视为为考上本科
//
//	//1.用户输入分数
//	int score = 0;
//	cout << "请输入您的分数：" << endl;
//
//	cin >> score;
//
//
//	//2.提示用户输入的分数
//	cout << "您输入的分数为：" << score << endl;
//
//	//3.判断
//	if(score>600)
//	{
//		cout << "恭喜您，考上了一本大学！" << endl;
//	}
//	else if (score>500)
//	{
//		cout << "恭喜您，考上了二本大学！" << endl;
//	}
//	else if (score>400)
//	{
//		cout << "恭喜您，考上了三本大学！" << endl;
//	}
//	else
//	{
//		cout << "很遗憾，您为考上大学，再接再厉！" << endl;
//	}
//	
//	
//}