package Day_05_方法;

public class _06_作用域 {
    static void main(String[] args) {

        /*
        Java 作用域
            在Java中，变量只能在创建的区域内访问。这称为作用域。

            代码块可以单独存在，也可以属于 if, while 或 for 语句。
            对于 for 语句，语句本身中声明的变量在块的作用域也可用。


        方法作用域
            直接在方法中声明的变量在方法中的任何位置都可用，
            位于声明它们的代码行之后:
         */

        // 此处的代码不能使用 x

        int x = 100;

        // 这里的代码可以使用 x
        System.out.println(x);

        /*
        块作用域
            代码块是指大括号 {} 之间的所有代码。
            在代码块内声明的变量只能由大括号之间的代码访问，
            大括号在声明变量的那一行之后:
         */

        // 此处的代码不能使用 y

        { // 这是一个块

            // 此处的代码不能使用 y

            int y = 100;

            // 这里的代码可以使用 x
            System.out.println(y);

        } // 区块到此结束

        // 此处的代码不能使用 x



    }
}
