"""
    切片
·切片是指对操作的对象截取其中一部分的操作。
·字符串、列表、元祖都支持切片操作

    ·语法：
        ·序列名[开始位置的下标；结束位置的下标；步长]

注意：
    ·不包含结束位置下标对应的数据，正负整数均可；
    ·步长是选取间隔，正负整数均可，默认步长为1（即可不写步长）
"""


# 序列名[开始位置的下标；结束位置的下标；步长]

str1 = "012345678"
print("2:5:1\t", str1[2:5:1])    # 234
print("2:5:2\t", str1[2:5:2])  # 24
print("2:5\t", str1[2:5])    # 234
print(":5\t", str1[:5])    # 01234 >>> 如果不写开始，默认从0开始选取
print("2:\t", str1[2:])    # 2345678 >>> 如果不写结束，表示选取到最后
print(":\t", str1[:])     # 012345678 >>> 如果不写开始和结束，表示选取所有


# 负数调试
print("倒序\t", str1[::-1])   # 876543210 >>> 如果步长为负数，表示倒序选取
print("-4:-1\t", str1[-4:-1])  # 567 >>> 下标-1表示最后一个数据，依次向前类推


# 测试
print("-4:-1:-1\t", str1[-4:-1:-1])   # 无（不能选取出数据） >>> 从-4开始到-1结束，选取方向为从左到右


