
/*
	数组
		
		所谓数组，就是一个集合，里面存放了相同类型的数组元素

	特点：
		- 数组中的每一个数组元素都是相同的数据类型
		- 数组是由连续的内存位置组成的
*/

//#include<iostream>
//using namespace std;
//
//int main() {
//
//	//1.数据类型 数组名[数组长度]
//	int arr[5];
//	arr[0] = 10;
//	arr[1] = 20;
//	arr[2] = 30;
//	arr[3] = 40;
//	arr[4] = 50;
//
//	//访问
//	/*cout << arr[0] << endl;
//	cout << arr[1] << endl;
//	cout << arr[2] << endl;
//	cout << arr[3] << endl;
//	cout << arr[4] << endl;*/
//
//	//2.数据类型了数组名[数组长度]＝{值1，值2}
//	int arr2[5] = { 10,20,30,40,50 };
//
//	//利用循环 输出数组中的数据
//	for (int i = 0; i < 5; i++) {
//		cout << arr2[i] << endl;
//	}
//
//	cout << "*******************************" << endl;
//
//	//3.数据类型 数组名[] = {值1,值2}
//	//定义数组的时候，必须有初始长度
//	int arr3[] = { 90,80,70,60,50,40,30,20,10,5,1 };
//	for (int a = 0; a < 11; a++) {
//		cout << arr3[a] << endl;
//	}
//
//}
