//#include<stdio.h>
//
//int main() {
//
//	int n, m;
//
//	scanf("%d,%d", &n, &m);
//
//	int x = 0;
//
//	/*int i = 0;
//	for (i = 0; x % m == 0; i++)
//	{
//
//	}
//	*/
//
//	/*
//		其基本原理是将两个整数进行相除，
//		然后将得到的余数再次与被除数进行相除，
//		直至余数为0，
//		此时的除数即为两个整数的最大公约数。
//
//		48 36
//		
//		48 % 36 = 12
//		
//		36 12
//
//		36 % 12 = 3
//
//		12 3
//		
//		12 % 3 = 0
//
//		print("12");
//	*/
//
//	while (m != 0) {
//		x = n % m;
//		n = m;
//		m = x;
//
//	}
//
//	printf("%d", n);
//
//
//	return 0;
//}